---
kind: type
id: T:Autodesk.Revit.DB.HermiteSurface
source: html/55ff0501-286a-79d6-0530-b34ce6ce09af.htm
---
# Autodesk.Revit.DB.HermiteSurface

A Hermite Surface.

## Syntax (C#)
```csharp
public class HermiteSurface : Surface
```